{
    "title": "Sentinel Protocol",
    "tagline": "Perimeter Intelligence Sync",
    "updated": "2026-02-13 11:29 UTC",
    "news": [
        {
            "source": {
                "id": "the-times-of-india",
                "name": "The Times of India"
            },
            "author": "PTI",
            "title": "Airports Authority of India allocates Rs 3,490 crores for modernisation of air navigation infrastructure",
            "description": "Airports Authority of India will invest Rs 3,490 crore to upgrade air navigation systems. This includes Rs 1,532 crore for automating air traffic management. The modernization aims to handle increasing air traffic. AAI is also strengthening its cybersecurity …",
            "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/airports-authority-of-india-allocates-rs-3490-crores-for-modernisation-of-air-navigation-infrastructure/articleshow/128255016.cms",
            "urlToImage": "https://img.etimg.com/thumb/msid-128255127,width-1200,height-630,imgsize-132638,overlay-economictimes/articleshow.jpg",
            "publishedAt": "2026-02-12T11:18:44Z",
            "content": "New Delhi: State-owned Airports Authority of India (AAI) has earmarked Rs 3,490 crore for upgradation of air navigation infrastructure, including Rs 1,532 crore for automation of air traffic manageme… [+1717 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Ghacks Technology News"
            },
            "author": "Arthur Kay",
            "title": "Apple Fixes Zero-Day Used in Targeted Attacks",
            "description": "Apple has released emergency security updates to fix a zero-day vulnerability that was reportedly used in what the company describes as an “extremely soph\nThank you for being a Ghacks reader. The post Apple Fixes Zero-Day Used in Targeted Attacks appeared fir…",
            "url": "https://www.ghacks.net/2026/02/12/apple-fixes-zero-day-used-in-targeted-attacks/",
            "urlToImage": "https://www.ghacks.net/wp-content/uploads/2026/02/gHacks-articles-51.png",
            "publishedAt": "2026-02-12T11:13:33Z",
            "content": "Apple has released emergency security updates to fix a zero-day vulnerability that was reportedly used in what the company describes as an “extremely sophisticated” attack against specific individual… [+2471 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Amazon.com"
            },
            "author": "aws@amazon.com",
            "title": "AWS Backup adds cross-Region database snapshot copy to logically air-gapped vaults",
            "description": "AWS Backup now supports single-action database snapshot copies to logically air-gapped vaults across AWS Regions. This capability is available for Amazon Aurora, Amazon Neptune, and Amazon DocumentDB snapshots, eliminating the need for an intermediate copying…",
            "url": "https://aws.amazon.com/about-aws/whats-new/2026/02/aws-backup-adds-cross-region-database-snapshot-logically-air-gapped-vaults/",
            "urlToImage": null,
            "publishedAt": "2026-02-12T11:00:00Z",
            "content": "AWS Backup now supports single-action database snapshot copies to logically air-gapped vaults across AWS Regions. This capability is available for Amazon Aurora, Amazon Neptune, and Amazon DocumentDB… [+1090 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "MIT Technology Review"
            },
            "author": "Rhiannon Williams",
            "title": "AI is already making online swindles easier. It could get much worse.",
            "description": "Anton Cherepanov is always on the lookout for something interesting. And in late August last year, he spotted just that. It was a file uploaded to VirusTotal, a site cybersecurity researchers like him use to analyze submissions for potential viruses and other…",
            "url": "https://www.technologyreview.com/2026/02/12/1132386/ai-already-making-online-swindles-easier/",
            "urlToImage": "https://wp.technologyreview.com/wp-content/uploads/2026/02/opener-final1_social.jpg?resize=1200,600",
            "publishedAt": "2026-02-12T11:00:00Z",
            "content": "Cherepanov and Strýek were confident that their discovery, which they dubbed PromptLock, marked a turning point in generative AI, showing how the technology could be exploited to create highly flexib… [+3148 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Help Net Security"
            },
            "author": "Zeljka Zorz",
            "title": "Apple fixes zero-day flaw exploited in targeted attacks (CVE-2026-20700)",
            "description": "Apple has released fixes for a zero-day vulnerability (CVE-2026-20700) exploited in targeted attacks last year. CVE-2026-20700 is a memory corruption issue in dyld, the Dynamic Link Editor component of Apple’s operating systems, and may allow attackers with m…",
            "url": "https://www.helpnetsecurity.com/2026/02/12/apple-zero-day-fixed-cve-2026-20700/",
            "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2024/11/20114617/apple1.webp",
            "publishedAt": "2026-02-12T10:55:26Z",
            "content": "Apple has released fixes for a zero-day vulnerability (CVE-2026-20700) exploited in targeted attacks last year.\r\nCVE-2026-20700 is a memory corruption issue in dyld, the Dynamic Link Editor component… [+1428 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Securityaffairs.com"
            },
            "author": "Pierluigi Paganini",
            "title": "Apple fixed first actively exploited zero-day in 2026",
            "description": "Apple fixed an exploited zero-day in iOS, macOS, and other devices that allowed attackers to run code via a memory flaw. Apple released updates for iOS, iPadOS, macOS, watchOS, tvOS, and visionOS to address an actively exploited zero-day tracked as CVE-2026-2…",
            "url": "https://securityaffairs.com/187890/security/apple-fixed-first-actively-exploited-zero-day-in-2026.html",
            "urlToImage": "https://securityaffairs.com/wp-content/uploads/2021/03/apple.jpg",
            "publishedAt": "2026-02-12T10:50:10Z",
            "content": "Apple fixed first actively exploited zero-day in 2026\r\nApple released updates for iOS, iPadOS, macOS, watchOS, tvOS, and visionOS to address an actively exploited zero-day tracked as CVE-2026-20700. … [+3229 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CNA"
            },
            "author": null,
            "title": "Check Point Software expects boost from AI cyber protection as Q4 profit jumps",
            "description": "JERUSALEM, Feb 12 : Check Point Software Technologies beat expectations for fourth-quarter profit on Thursday, and said a fast-growing need to protect computer networks from artificial intelligence-led cyber threats would help drive growth in 2026.Companies a…",
            "url": "https://www.channelnewsasia.com/business/check-point-software-expects-boost-ai-cyber-protection-q4-profit-jumps-5926261",
            "urlToImage": "https://dam.mediacorp.sg/image/upload/s--ZdHPGX9S--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/one-cms/images/2021-06/business_1.png?itok=npguKy4y",
            "publishedAt": "2026-02-12T10:38:37Z",
            "content": "JERUSALEM, Feb 12 : Check Point Software Technologies beat expectations for fourth-quarter profit on Thursday, and said a fast-growing need to protect computer networks from artificial intelligence-l… [+1657 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Internet"
            },
            "author": "info@thehackernews.com (The Hacker News)",
            "title": "The CTEM Divide: Why 84% of Security Programs Are Falling Behind",
            "description": "A new 2026 market intelligence study of 128 enterprise security decision-makers (available here) reveals a stark divide forming between organizations – one that has nothing to do with budget size or industry and everything to do with a single framework decisi…",
            "url": "https://thehackernews.com/2026/02/the-ctem-divide-why-84-of-security.html",
            "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj-Y-YsMsEZEaAST2HjBLPOIzmYNnp_eVs86gMuTbqJbVwF158EvQL9q9rL1a70OEUBIjCdDVnxDplv4zCXMSdqauKR-t_qENqr8G3yNCXQH5Mbq8H4CsPD2vLXMBq3iwoInmaKtvKbGs-TC0SiL0q1-4VoWxGpl7CTarAuQNInAaRieusoULkPAKgTU5g/s1700-e365/ctem.jpg",
            "publishedAt": "2026-02-12T10:30:00Z",
            "content": "A new 2026 market intelligence study of 128 enterprise security decision-makers (available here) reveals a stark divide forming between organizations – one that has nothing to do with budget size or … [+4453 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Star Online"
            },
            "author": "The Star Online",
            "title": "MyDigital ID targets 17 million registered accounts by end-2026",
            "description": "KUALA LUMPUR: My Digital ID Sdn Bhd aims to achieve 17 million MyDigital ID registered accounts from Malaysians by the end of 2026, as compared to 7.3 million accounts as at the end of last year. Read full story",
            "url": "https://www.thestar.com.my/news/nation/2026/02/12/mydigital-id-targets-17-million-registered-accounts-by-end-2026",
            "urlToImage": "https://apicms.thestar.com.my/uploads/images/2026/02/12/3767730.jpg",
            "publishedAt": "2026-02-12T10:14:00Z",
            "content": "KUALA LUMPUR: My Digital ID Sdn Bhd aims to achieve 17 million MyDigital ID registered accounts from Malaysians by the end of 2026, as compared to 7.3 million accounts as at the end of last year.\r\nDe… [+2510 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NPR"
            },
            "author": "Ayana Archie",
            "title": "How the FBI might have gotten inaccessible camera footage from Nancy Guthrie's house",
            "description": "Last week, law enforcement said video footage from Nancy Guthrie's doorbell camera was overwritten. But the FBI has since released footage as Guthrie still has not been found.",
            "url": "https://www.npr.org/2026/02/12/nx-s1-5711620/nancy-guthrie-video-footage-fbi",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2000x1125+0+207/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F6f%2Fc82b568e41639425f91178cf2039%2Fap26036806036039.jpg",
            "publishedAt": "2026-02-12T10:00:00Z",
            "content": "As the investigation into Nancy Guthrie's disappearance continues, law enforcement has been able to get its hands on doorbell footage it previously said was inaccessible.\r\nThe FBI released Google Nes… [+3616 chars]"
        }
    ]
}